app/Controllers/TaskController.php

    public function index()
    {
        $taskModel = new \App\Models\TaskModel();
        $tasks = $taskModel->findAll();
---
SELECT *
FROM `tasks`